package entity

import (
	"time"

	"golang.org/x/crypto/bcrypt"
	"gorm.io/driver/sqlite"
	"gorm.io/gorm"
)

var db *gorm.DB

func DB() *gorm.DB {
	return db
}

// Function to create a gender in the database
func createGender(db *gorm.DB, name string) {
	gender := Gender{
		Name: name,
	}
	db.Model(&Gender{}).Create(&gender)
}

// Function to create a province in the database
func createProvince(db *gorm.DB, name string) {
	province := Province{
		Name: name,
	}
	db.Model(&Province{}).Create(&province)
}

// Function to create a district in the database
func createDistrict(db *gorm.DB, name, postcode string, provinceID uint) {
	district := District{
		Name:       name,
		Postcode:   postcode,
		ProvinceID: &provinceID,
	}
	db.Model(&District{}).Create(&district)
}

// Function to create an occupation in the database
func createOccupation(db *gorm.DB, name string) {
	occupation := Occupation{
		Name: name,
	}
	db.Model(&Occupation{}).Create(&occupation)
}

// Function to create a salary in the database
func createSalary(db *gorm.DB, salary string) {
	salaries := Salary{
		Salary: salary,
	}
	db.Model(&Salary{}).Create(&salaries)
}

func SetupDatabase() {
	database, err := gorm.Open(sqlite.Open("seller.db"), &gorm.Config{})

	if err != nil {
		panic("Failed to connect database!")
	}

	// Migrate the schema

	database.AutoMigrate(
		&Gender{},
		&Province{},
		&District{},
		&Occupation{},
		&Salary{},
		&User{},

		&ProductType{},
		&Promotion{},
		&Product{},

		&PaymentMethod{},
		&Receipt{},
		&Purchase{},
	)

	db = database

	// -------------------------------------------<< Gender >>------------------------------------

	// Create Genders
	genders := []string{
		"Male", "Female", "Not specified",
	}

	for _, gender := range genders {
		createGender(db, gender)
	}

	// -------------------------------------------<< Province >>------------------------------------

	// Create Provinces from Province1 to Province77
	provinces := []string{
		"กรุงเทพมหานคร", "กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร",
		"ขอนแก่น", "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท", "ชัยภูมิ",
		"ชุมพร", "เชียงราย", "เชียงใหม่", "ตรัง", "ตราด", "ตาก", "นครนายก",
		"นครปฐม", "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์", "นนทบุรี",
		"นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์",
		"ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พังงา", "พัทลุง", "พิจิตร",
		"พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "พะเยา", "ภูเก็ต",
		"มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน", "ยโสธร", "ยะลา", "ร้อยเอ็ด",
		"ระนอง", "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย",
		"ศรีสะเกษ", "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ", "สมุทรสงคราม",
		"สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี", "สุโขทัย", "สุพรรณบุรี",
		"สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง",
		"อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี", "อำนาจเจริญ",
	}

	for _, province := range provinces {
		createProvince(db, province)
	}

	// -------------------------------------------<< District >>------------------------------------

	// Create Districts
	districtsData := []struct {
		Name       string
		PostCode   string
		ProvinceID uint
	}{
		{"เขตคลองสาน", "10600", 1},
		{"เขตคลองสามวา", "10510", 1},
		{"เขตคลองเตย", "10110", 1},
		{"เขตคันนายาว", "10230", 1},
		{"เขตจตุจักร", "10900", 1},
		{"เขตจอมทอง", "10150", 1},
		{"เขตดอนเมือง", "10210", 1},
		{"เขตดินแดง", "10400", 1},
		{"เขตดุสิต", "10300", 1},
		{"เขตตลิ่งชัน", "10170", 1},
		{"เขตทวีวัฒนา", "10170", 1},
		{"เขตทุ่งครุ", "10140", 1},
		{"เขตธนบุรี", "10600", 1},
		{"เขตบางกอกน้อย", "10700", 1},
		{"เขตบางกอกใหญ่", "10600", 1},
		{"เขตบางกะปิ", "10240", 1},
		{"เขตบางขุนเทียน", "10150", 1},
		{"เขตบางคอแหลม", "10120", 1},
		{"เขตบางซื่อ", "10800", 1},
		{"เขตบางนา", "10260", 1},
		{"เขตบางบอน", "10150", 1},
		{"เขตบางพลัด", "10700", 1},
		{"เขตบางรัก", "10500", 1},
		{"เขตบางเขน", "10220", 1},
		{"เขตบางแค", "10160", 1},
		{"เขตบึงกุ่ม", "10240", 1},
		{"เขตปทุมวัน", "10330", 1},
		{"เขตประเวศ", "10250", 1},
		{"เขตป้อมปราบศัตรูพ่าย", "10100", 1},
		{"เขตพญาไท", "10400", 1},
		{"เขตพระนคร", "10200", 1},
		{"เขตพระโขนง", "10260", 1},
		{"เขตภาษีเจริญ", "10160", 1},
		{"เขตมีนบุรี", "10510", 1},
		{"เขตยานนาวา", "10120", 1},
		{"เขตราชเทวี", "10400", 1},
		{"เขตราษฎร์บูรณะ", "10140", 1},
		{"เขตลาดกระบัง", "10520", 1},
		{"เขตลาดพร้าว", "10230", 1},
		{"เขตวังทองหลาง", "10310", 1},
		{"เขตวัฒนา", "10110", 1},
		{"เขตสวนหลวง", "10250", 1},
		{"เขตสะพานสูง", "10240", 1},
		{"เขตสัมพันธวงศ์", "10100", 1},
		{"เขตสาทร", "10120", 1},
		{"เขตสายไหม", "10220", 1},
		{"เขตหนองจอก", "10530", 1},
		{"เขตหนองแขม", "10160", 1},
		{"เขตหลักสี่", "10210", 1},
		{"เขตห้วยขวาง", "10310", 1},
		{"คลองท่อม", "81120", 2},
		{"ปลายพระยา", "81160", 2},
		{"ลำทับ", "81120", 2},
		{"อ่าวลึก", "81110", 2},
		{"เกาะลันตา", "81150", 2},
		{"เขาพนม", "81140", 2},
		{"เมืองกระบี่", "81000", 2},
		{"เหนือคลอง", "81130", 2},
		{"ด่านมะขามเตี้ย", "71260", 3},
		{"ทองผาภูมิ", "71180", 3},
		{"ท่าม่วง", "71110", 3},
		{"ท่ามะกา", "71120", 3},
		{"บ่อพลอย", "71160", 3},
		{"พนมทวน", "71140", 3},
		{"ศรีสวัสดิ์", "71250", 3},
		{"สังขละบุรี", "71240", 3},
		{"หนองปรือ", "71220", 3},
		{"ห้วยกระเจา", "71170", 3},
		{"เมืองกาญจนบุรี", "71000", 3},
		{"เลาขวัญ", "71210", 3},
		{"ไทรโยค", "71150", 3},
		{"กมลาไสย", "46130", 4},
		{"กุฉินารายณ์", "46110", 4},
		{"คำม่วง", "46180", 4},
		{"ฆ้องชัย", "46130", 4},
		{"ดอนจาน", "46000", 4},
		{"ท่าคันโท", "46190", 4},
		{"นาคู", "46160", 4},
		{"นามน", "46230", 4},
		{"ยางตลาด", "46120", 4},
		{"ร่องคำ", "46210", 4},
		{"สมเด็จ", "46150", 4},
		{"สหัสขันธ์", "46140", 4},
		{"สามชัย", "46180", 4},
		{"หนองกุงศรี", "46220", 4},
		{"ห้วยผึ้ง", "46240", 4},
		{"ห้วยเม็ก", "46170", 4},
		{"เขาวง", "46160", 4},
		{"เมืองกาฬสินธุ์", "46000", 4},
		{"ขาณุวรลักษบุรี", "62130", 5},
		{"คลองขลุง", "62120", 5},
		{"คลองลาน", "62180", 5},
		{"ทรายทองวัฒนา", "62190", 5},
		{"บึงสามัคคี", "62210", 5},
		{"ปางศิลาทอง", "62120", 5},
		{"พรานกระต่าย", "62110", 5},
		{"ลานกระบือ", "62170", 5},
		{"เมืองกำแพงเพชร", "62000", 5},
		{"โกสัมพีนคร", "62000", 5},
		{"ไทรงาม", "62150", 5},
		{"กระนวน", "40170", 6},
		{"ชนบท", "40180", 6},
		{"ชุมแพ", "40130", 6},
		{"ซำสูง", "40170", 6},
		{"น้ำพอง", "40140", 6},
		{"บ้านฝาง", "40270", 6},
		{"บ้านแฮด", "40110", 6},
		{"บ้านไผ่", "40110", 6},
		{"พระยืน", "40320", 6},
		{"พล", "40120", 6},
		{"ภูผาม่าน", "40350", 6},
		{"ภูเวียง", "40150", 6},
		{"มัญจาคีรี", "40160", 6},
		{"สีชมพู", "40220", 6},
		{"หนองนาคำ", "40150", 6},
		{"หนองสองห้อง", "40190", 6},
		{"หนองเรือ", "40210", 6},
		{"อุบลรัตน์", "40250", 6},
		{"เขาสวนกวาง", "40280", 6},
		{"เปือยน้อย", "40340", 6},
		{"เมืองขอนแก่น", "40000", 6},
		{"เวียงเก่า", "คัดลอก", 6},
		{"แวงน้อย", "40230", 6},
		{"แวงใหญ่", "40330", 6},
		{"โคกโพธิ์ไชย", "40160", 6},
		{"โนนศิลา", "40110", 6},
		{"ขลุง", "22110", 7},
		{"ท่าใหม่", "22120", 7},
		{"นายายอาม", "22160", 7},
		{"มะขาม", "22150", 7},
		{"สอยดาว", "22180", 7},
		{"เขาคิชฌกูฏ", "22210", 7},
		{"เมืองจันทบุรี", "22000", 7},
		{"แก่งหางแมว", "22160", 7},
		{"แหลมสิงห์", "22130", 7},
		{"โป่งน้ำร้อน", "22140", 7},
		{"คลองเขื่อน", "24000", 8},
		{"ท่าตะเกียบ", "24160", 8},
		{"บางคล้า", "24110", 8},
		{"บางน้ำเปรี้ยว", "24150", 8},
		{"บางปะกง", "24130", 8},
		{"บ้านโพธิ์", "24140", 8},
		{"พนมสารคาม", "24120", 8},
		{"ราชสาส์น", "24120", 8},
		{"สนามชัยเขต", "24160", 8},
		{"เมืองฉะเชิงเทรา", "24000", 8},
		{"แปลงยาว", "24190", 8},
		{"บ่อทอง", "20270", 9},
		{"บางละมุง", "20150", 9},
		{"บ้านบึง", "20170", 9},
		{"พนัสนิคม", "20140", 9},
		{"พานทอง", "20160", 9},
		{"ศรีราชา", "20110", 9},
		{"สัตหีบ", "20180", 9},
		{"หนองใหญ่", "20190", 9},
		{"เกาะจันทร์", "20240", 9},
		{"เกาะสีชัง", "20120", 9},
		{"เมืองชลบุรี", "20000", 9},
		{"มโนรมย์", "17110", 10},
		{"วัดสิงห์", "17120", 10},
		{"สรรคบุรี", "17140", 10},
		{"สรรพยา", "17150", 10},
		{"หนองมะโมง", "17120", 10},
		{"หันคา", "17130", 10},
		{"เนินขาม", "17130", 10},
		{"เมืองชัยนาท", "17000", 10},
		{"คอนสวรรค์", "36140", 11},
		{"คอนสาร", "36180", 11},
		{"จัตุรัส", "36130", 11},
		{"ซับใหญ่", "36130", 11},
		{"บ้านเขว้า", "36170", 11},
		{"บ้านแท่น", "36190", 11},
		{"บำเหน็จณรงค์", "36160", 11},
		{"ภักดีชุมพล", "36260", 11},
		{"ภูเขียว", "36110", 11},
		{"หนองบัวระเหว", "36250", 11},
		{"หนองบัวแดง", "36210", 11},
		{"เกษตรสมบูรณ์", "36120", 11},
		{"เทพสถิต", "36230", 11},
		{"เนินสง่า", "36130", 11},
		{"เมืองชัยภูมิ", "36000", 11},
		{"แก้งคร้อ", "36150", 11},
		{"ท่าแซะ", "86140", 12},
		{"ทุ่งตะโก", "86220", 12},
		{"ปะทิว", "86160", 12},
		{"พะโต๊ะ", "86180", 12},
		{"ละแม", "86170", 12},
		{"สวี", "86130", 12},
		{"หลังสวน", "86110", 12},
		{"เมืองชุมพร", "86000", 12},
		{"ขุนตาล", "57340", 13},
		{"ดอยหลวง", "57110", 13},
		{"ป่าแดด", "57190", 13},
		{"พญาเม็งราย", "57290", 13},
		{"พาน", "57120", 13},
		{"เชียงของ", "57140", 13},
		{"เชียงแสน", "57150", 13},
		{"เทิง", "57160", 13},
		{"เมืองเชียงราย", "57000", 13},
		{"เวียงชัย", "57210", 13},
		{"เวียงป่าเป้า", "57170", 13},
		{"เวียงเชียงรุ้ง", "57210", 13},
		{"เวียงแก่น", "57310", 13},
		{"แม่จัน", "57110", 13},
		{"แม่ฟ้าหลวง", "57240", 13},
		{"แม่ลาว", "57250", 13},
		{"แม่สรวย", "57180", 13},
		{"แม่สาย", "57130", 13},
		{"จอมทอง", "50160", 14},
		{"ดอยสะเก็ด", "50220", 14},
		{"ดอยหล่อ", "50160", 14},
		{"ดอยเต่า", "50260", 14},
		{"ฝาง", "50110", 14},
		{"พร้าว", "50190", 14},
		{"สะเมิง", "50250", 14},
		{"สันกำแพง", "50130", 14},
		{"สันทราย", "50210", 14},
		{"สันป่าตอง", "50120", 14},
		{"สารภี", "50140", 14},
		{"หางดง", "50230", 14},
		{"อมก๋อย", "50310", 14},
		{"ฮอด", "50240", 14},
		{"เชียงดาว", "50170", 14},
		{"เมืองเชียงใหม่", "50200", 14},
		{"เวียงแหง", "50350", 14},
		{"แม่ริม", "50180", 14},
		{"แม่วาง", "50360", 14},
		{"แม่ออน", "50130", 14},
		{"แม่อาย", "50280", 14},
		{"แม่แจ่ม", "50270", 14},
		{"แม่แตง", "50150", 14},
		{"ไชยปราการ", "50320", 14},
		{"กันตัง", "92110", 15},
		{"นาโยง", "92170", 15},
		{"ปะเหลียน", "92120", 15},
		{"ย่านตาขาว", "92140", 15},
		{"รัษฎา", "92160", 15},
		{"วังวิเศษ", "92220", 15},
		{"สิเกา", "92150", 15},
		{"ห้วยยอด", "92130", 15},
		{"หาดสำราญ", "92120", 15},
		{"เมืองตรัง", "92000", 15},
		{"คลองใหญ่", "23110", 16},
		{"บ่อไร่", "23140", 16},
		{"เกาะกูด", "23000", 16},
		{"เกาะช้าง", "23170", 16},
		{"เขาสมิง", "23130", 16},
		{"เมืองตราด", "23000", 16},
		{"แหลมงอบ", "23120", 16},
		{"ท่าสองยาง", "63150", 17},
		{"บ้านตาก", "63120", 17},
		{"พบพระ", "63160", 17},
		{"วังเจ้า", "63000", 17},
		{"สามเงา", "63130", 17},
		{"อุ้มผาง", "63170", 17},
		{"เมืองตาก", "63000", 17},
		{"แม่ระมาด", "63140", 17},
		{"แม่สอด", "63110", 17},
		{"บ้านนา", "26110", 18},
		{"ปากพลี", "26130", 18},
		{"องครักษ์", "26120", 18},
		{"เมืองนครนายก", "26000", 18},
		{"กำแพงแสน", "73140", 19},
		{"ดอนตูม", "73150", 19},
		{"นครชัยศรี", "73120", 19},
		{"บางเลน", "73130", 19},
		{"พุทธมณฑล", "73170", 19},
		{"สามพราน", "73110", 19},
		{"เมืองนครปฐม", "73000", 19},
		{"ท่าอุเทน", "48120", 20},
		{"ธาตุพนม", "48110", 20},
		{"นาทม", "48140", 20},
		{"นาหว้า", "48180", 20},
		{"นาแก", "48130", 20},
		{"บ้านแพง", "48140", 20},
		{"ปลาปาก", "48160", 20},
		{"วังยาง", "48130", 20},
		{"ศรีสงคราม", "48150", 20},
		{"เมืองนครพนม", "48000", 20},
		{"เรณูนคร", "48170", 20},
		{"โพนสวรรค์", "48190", 20},
		{"ขามทะเลสอ", "30280", 21},
		{"ขามสะแกแสง", "30290", 21},
		{"คง", "30260", 21},
		{"ครบุรี", "30250", 21},
		{"จักราช", "30230", 21},
		{"ชุมพวง", "30270", 21},
		{"ด่านขุนทด", "30210", 21},
		{"บัวลาย", "30120", 21},
		{"บัวใหญ่", "30120", 21},
		{"บ้านเหลื่อม", "30350", 21},
		{"ประทาย", "30180", 21},
		{"ปักธงชัย", "30150", 21},
		{"ปากช่อง", "30130", 21},
		{"พระทองคำ", "30220", 21},
		{"พิมาย", "30110", 21},
		{"ลำทะเมนชัย", "30270", 21},
		{"วังน้ำเขียว", "30370", 21},
		{"สีคิ้ว", "30140", 21},
		{"สีดา", "30430", 21},
		{"สูงเนิน", "30170", 21},
		{"หนองบุญมาก", "30410", 21},
		{"ห้วยแถลง", "30240", 21},
		{"เฉลิมพระเกียรติ", "30230", 21},
		{"เทพารักษ์", "30210", 21},
		{"เมืองนครราชสีมา", "30000", 21},
		{"เมืองยาง", "30270", 21},
		{"เสิงสาง", "30330", 21},
		{"แก้งสนามนาง", "30440", 21},
		{"โชคชัย", "30190", 21},
		{"โนนสูง", "30160", 21},
		{"โนนแดง", "30360", 21},
		{"โนนไทย", "30220", 21},
		{"ขนอม", "80210", 22},
		{"จุฬาภรณ์", "80180", 22},
		{"ฉวาง", "80150", 22},
		{"ชะอวด", "80180", 22},
		{"ช้างกลาง", "80250", 22},
		{"ถ้ำพรรณรา", "80260", 22},
		{"ท่าศาลา", "80160", 22},
		{"ทุ่งสง", "80110", 22},
		{"ทุ่งใหญ่", "80240", 22},
		{"นบพิตำ", "80160", 22},
		{"นาบอน", "80220", 22},
		{"บางขัน", "80360", 22},
		{"ปากพนัง", "80140", 22},
		{"พรหมคีรี", "80320", 22},
		{"พระพรหม", "80000", 22},
		{"พิปูน", "80270", 22},
		{"ร่อนพิบูลย์", "80130", 22},
		{"ลานสกา", "80230", 22},
		{"สิชล", "80120", 22},
		{"หัวไทร", "80170", 22},
		{"เฉลิมพระเกียรติ", "80190", 22},
		{"เชียรใหญ่", "80190", 22},
		{"เมืองนครศรีธรรมราช", "80000", 22},
		{"ชุมตาบง", "60150", 23},
		{"ชุมแสง", "60120", 23},
		{"ตากฟ้า", "60190", 23},
		{"ตาคลี", "60140", 23},
		{"ท่าตะโก", "60160", 23},
		{"บรรพตพิสัย", "60180", 23},
		{"พยุหะคีรี", "60130", 23},
		{"ลาดยาว", "60150", 23},
		{"หนองบัว", "60110", 23},
		{"เก้าเลี้ยว", "60230", 23},
		{"เมืองนครสวรรค์", "60000", 23},
		{"แม่วงก์", "60150", 23},
		{"แม่เปิน", "60150", 23},
		{"โกรกพระ", "60170", 23},
		{"ไพศาลี", "60220", 23},
		{"บางกรวย", "11130", 24},
		{"บางบัวทอง", "11110", 24},
		{"บางใหญ่", "11140", 24},
		{"ปากเกร็ด", "11120", 24},
		{"เมืองนนทบุรี", "11000", 24},
		{"ไทรน้อย", "11150", 24},
		{"จะแนะ", "96220", 25},
		{"ตากใบ", "96110", 25},
		{"บาเจาะ", "96170", 25},
		{"ยี่งอ", "96180", 25},
		{"ระแงะ", "96130", 25},
		{"รือเสาะ", "96150", 25},
		{"ศรีสาคร", "96210", 25},
		{"สุคิริน", "96190", 25},
		{"สุไหงปาดี", "96140", 25},
		{"สุไหงโก-ลก", "96120", 25},
		{"เจาะไอร้อง", "96130", 25},
		{"เมืองนราธิวาส", "96000", 25},
		{"แว้ง", "96160", 25},
		{"ท่าวังผา", "55140", 26},
		{"ทุ่งช้าง", "55130", 26},
		{"นาน้อย", "55150", 26},
		{"นาหมื่น", "55180", 26},
		{"บ่อเกลือ", "55220", 26},
		{"บ้านหลวง", "55190", 26},
		{"ปัว", "55120", 26},
		{"ภูเพียง", "55000", 26},
		{"สองแคว", "55160", 26},
		{"สันติสุข", "55210", 26},
		{"เฉลิมพระเกียรติ", "55130", 26},
		{"เชียงกลาง", "55160", 26},
		{"เมืองน่าน", "55000", 26},
		{"เวียงสา", "55110", 26},
		{"แม่จริม", "55170", 26},
		{"บึงโขงหลง", "38220", 27},
		{"บุ่งคล้า", "38000", 27},
		{"ปากคาด", "38190", 27},
		{"พรเจริญ", "38180", 27},
		{"ศรีวิไล", "38210", 27},
		{"เซกา", "38150", 27},
		{"เมืองบึงกาฬ", "38000", 27},
		{"โซ่พิสัย", "38170", 27},
		{"กระสัง", "31160", 28},
		{"คูเมือง", "31190", 28},
		{"ชำนิ", "31110", 28},
		{"นางรอง", "31110", 28},
		{"นาโพธิ์", "31230", 28},
		{"บ้านกรวด", "31180", 28},
		{"บ้านด่าน", "31000", 28},
		{"บ้านใหม่ไชยพจน์", "31120", 28},
		{"ประโคนชัย", "31140", 28},
		{"ปะคำ", "31220", 28},
		{"พลับพลาชัย", "31250", 28},
		{"พุทไธสง", "31120", 28},
		{"ละหานทราย", "31170", 28},
		{"ลำปลายมาศ", "31130", 28},
		{"สตึก", "31150", 28},
		{"หนองกี่", "31210", 28},
		{"หนองหงส์", "31240", 28},
		{"ห้วยราช", "31000", 28},
		{"เฉลิมพระเกียรติ", "31110", 28},
		{"เมืองบุรีรัมย์", "31000", 28},
		{"แคนดง", "31150", 28},
		{"โนนดินแดง", "31260", 28},
		{"โนนสุวรรณ", "31110", 28},
		{"คลองหลวง", "12120", 29},
		{"ธัญบุรี", "12130", 29},
		{"ลาดหลุมแก้ว", "12140", 29},
		{"ลำลูกกา", "12130", 29},
		{"สามโคก", "12160", 29},
		{"หนองเสือ", "12170", 29},
		{"เมืองปทุมธานี", "12000", 29},
		{"กุยบุรี", "77150", 30},
		{"ทับสะแก", "77130", 30},
		{"บางสะพาน", "77140", 30},
		{"บางสะพานน้อย", "77170", 30},
		{"ปราณบุรี", "77120", 30},
		{"สามร้อยยอด", "77120", 30},
		{"หัวหิน", "77110", 30},
		{"เมืองประจวบคีรีขันธ์", "77000", 30},
		{"กบินทร์บุรี", "25110", 31},
		{"นาดี", "25220", 31},
		{"บ้านสร้าง", "25150", 31},
		{"ประจันตคาม", "25130", 31},
		{"ศรีมหาโพธิ", "25140", 31},
		{"ศรีมโหสถ", "25190", 31},
		{"เมืองปราจีนบุรี", "25000", 31},
		{"กะพ้อ", "94230", 32},
		{"ทุ่งยางแดง", "94140", 32},
		{"ปะนาเระ", "94130", 32},
		{"มายอ", "94140", 32},
		{"ยะรัง", "94160", 32},
		{"ยะหริ่ง", "94150", 32},
		{"สายบุรี", "94110", 32},
		{"หนองจิก", "94170", 32},
		{"เมืองปัตตานี", "94000", 32},
		{"แม่ลาน", "94180", 32},
		{"โคกโพธิ์", "94120", 32},
		{"ไม้แก่น", "94220", 32},
		{"ท่าเรือ", "13130", 33},
		{"นครหลวง", "13260", 33},
		{"บางซ้าย", "13270", 33},
		{"บางบาล", "13250", 33},
		{"บางปะหัน", "13220", 33},
		{"บางปะอิน", "13160", 33},
		{"บางไทร", "13190", 33},
		{"บ้านแพรก", "13240", 33},
		{"ผักไห่", "13120", 33},
		{"พระนครศรีอยุธยา", "13000", 33},
		{"ภาชี", "13140", 33},
		{"มหาราช", "13150", 33},
		{"ลาดบัวหลวง", "13230", 33},
		{"วังน้อย", "13170", 33},
		{"อุทัย", "13210", 33},
		{"เสนา", "13110", 33},
		{"กะปง", "82170", 34},
		{"คุระบุรี", "82150", 34},
		{"ตะกั่วทุ่ง", "82130", 34},
		{"ตะกั่วป่า", "82110", 34},
		{"ทับปุด", "82180", 34},
		{"ท้ายเหมือง", "82120", 34},
		{"เกาะยาว", "82160", 34},
		{"เมืองพังงา", "82000", 34},
		{"กงหรา", "93180", 35},
		{"ควนขนุน", "93110", 35},
		{"ตะโหมด", "93160", 35},
		{"บางแก้ว", "93140", 35},
		{"ปากพะยูน", "93120", 35},
		{"ป่าบอน", "93170", 35},
		{"ป่าพะยอม", "93110", 35},
		{"ศรีนครินทร์", "93000", 35},
		{"ศรีบรรพต", "93190", 35},
		{"เขาชัยสน", "93130", 35},
		{"เมืองพัทลุง", "93000", 35},
		{"ดงเจริญ", "66210", 36},
		{"ตะพานหิน", "66110", 36},
		{"ทับคล้อ", "66150", 36},
		{"บางมูลนาก", "66120", 36},
		{"บึงนาราง", "66130", 36},
		{"วชิรบารมี", "66140", 36},
		{"วังทรายพูน", "66180", 36},
		{"สากเหล็ก", "66160", 36},
		{"สามง่าม", "66140", 36},
		{"เมืองพิจิตร", "66000", 36},
		{"โพทะเล", "66130", 36},
		{"โพธิ์ประทับช้าง", "66190", 36},
		{"ชาติตระการ", "65170", 37},
		{"นครไทย", "65120", 37},
		{"บางกระทุ่ม", "65110", 37},
		{"บางระกำ", "65140", 37},
		{"พรหมพิราม", "65150", 37},
		{"วังทอง", "65130", 37},
		{"วัดโบสถ์", "65160", 37},
		{"เนินมะปราง", "65190", 37},
		{"เมืองพิษณุโลก", "65000", 37},
		{"ชะอำ", "76120", 38},
		{"ท่ายาง", "76130", 38},
		{"บ้านลาด", "76150", 38},
		{"บ้านแหลม", "76110", 38},
		{"หนองหญ้าปล้อง", "76160", 38},
		{"เขาย้อย", "76140", 38},
		{"เมืองเพชรบุรี", "76000", 38},
		{"แก่งกระจาน", "76170", 38},
		{"ชนแดน", "67150", 39},
		{"น้ำหนาว", "67260", 39},
		{"บึงสามพัน", "67160", 39},
		{"วังโป่ง", "67240", 39},
		{"วิเชียรบุรี", "67130", 39},
		{"ศรีเทพ", "67170", 39},
		{"หนองไผ่", "67140", 39},
		{"หล่มสัก", "67110", 39},
		{"หล่มเก่า", "67120", 39},
		{"เขาค้อ", "67270", 39},
		{"เมืองเพชรบูรณ์", "67000", 39},
		{"ร้องกวาง", "54140", 40},
		{"ลอง", "54150", 40},
		{"วังชิ้น", "54160", 40},
		{"สอง", "54120", 40},
		{"สูงเม่น", "54130", 40},
		{"หนองม่วงไข่", "54170", 40},
		{"เด่นชัย", "54110", 40},
		{"เมืองแพร่", "54000", 40},
		{"จุน", "56150", 41},
		{"ดอกคำใต้", "56120", 41},
		{"ปง", "56140", 41},
		{"ภูกามยาว", "56000", 41},
		{"ภูซาง", "56110", 41},
		{"เชียงคำ", "56110", 41},
		{"เชียงม่วน", "56160", 41},
		{"เมืองพะเยา", "56000", 41},
		{"แม่ใจ", "56130", 41},
		{"กะทู้", "83120", 42},
		{"ถลาง", "83110", 42},
		{"เมืองภูเก็ต", "83000", 42},
		{"กันทรวิชัย", "44150", 43},
		{"กุดรัง", "44130", 43},
		{"ชื่นชม", "44160", 43},
		{"นาดูน", "44180", 43},
		{"นาเชือก", "44170", 43},
		{"บรบือ", "44130", 43},
		{"พยัคฆภูมิพิสัย", "44110", 43},
		{"ยางสีสุราช", "44210", 43},
		{"วาปีปทุม", "44120", 43},
		{"เชียงยืน", "44160", 43},
		{"เมืองมหาสารคาม", "44000", 43},
		{"แกดำ", "44190", 43},
		{"โกสุมพิสัย", "44140", 43},
		{"คำชะอี", "49110", 44},
		{"ดงหลวง", "49140", 44},
		{"ดอนตาล", "49120", 44},
		{"นิคมคำสร้อย", "49130", 44},
		{"หนองสูง", "49160", 44},
		{"หว้านใหญ่", "49150", 44},
		{"เมืองมุกดาหาร", "49000", 44},
		{"ขุนยวม", "58140", 45},
		{"ปางมะผ้า", "58150", 45},
		{"ปาย", "58130", 45},
		{"สบเมย", "58110", 45},
		{"เมืองแม่ฮ่องสอน", "58000", 45},
		{"แม่ลาน้อย", "58120", 45},
		{"แม่สะเรียง", "58110", 45},
		{"กุดชุม", "35140", 46},
		{"ค้อวัง", "35160", 46},
		{"คำเขื่อนแก้ว", "35110", 46},
		{"ทรายมูล", "35170", 46},
		{"ป่าติ้ว", "35150", 46},
		{"มหาชนะชัย", "35130", 46},
		{"เมืองยโสธร", "35000", 46},
		{"เลิงนกทา", "35120", 46},
		{"ไทยเจริญ", "35120", 46},
		{"กรงปินัง", "95000", 47},
		{"กาบัง", "95120", 47},
		{"ธารโต", "95150", 47},
		{"บันนังสตา", "95130", 47},
		{"ยะหา", "95120", 47},
		{"รามัน", "95140", 47},
		{"เบตง", "95110", 47},
		{"เมืองยะลา", "95000", 47},
		{"จตุรพักตรพิมาน", "45180", 48},
		{"จังหาร", "45000", 48},
		{"ทุ่งเขาหลวง", "45170", 48},
		{"ธวัชบุรี", "45170", 48},
		{"ปทุมรัตต์", "45190", 48},
		{"พนมไพร", "45140", 48},
		{"ศรีสมเด็จ", "45000", 48},
		{"สุวรรณภูมิ", "45130", 48},
		{"หนองพอก", "45210", 48},
		{"หนองฮี", "45140", 48},
		{"อาจสามารถ", "45160", 48},
		{"เกษตรวิสัย", "45150", 48},
		{"เชียงขวัญ", "45000", 48},
		{"เมยวดี", "45250", 48},
		{"เมืองร้อยเอ็ด", "45000", 48},
		{"เมืองสรวง", "45220", 48},
		{"เสลภูมิ", "45120", 48},
		{"โพธิ์ชัย", "45230", 48},
		{"โพนทราย", "45240", 48},
		{"โพนทอง", "45110", 48},
		{"กระบุรี", "85110", 49},
		{"กะเปอร์", "85120", 49},
		{"ละอุ่น", "85130", 49},
		{"สุขสำราญ", "85120", 49},
		{"เมืองระนอง", "85000", 49},
		{"นิคมพัฒนา", "21180", 50},
		{"บ้านค่าย", "21120", 50},
		{"บ้านฉาง", "21130", 50},
		{"ปลวกแดง", "21140", 50},
		{"วังจันทร์", "21210", 50},
		{"เขาชะเมา", "21110", 50},
		{"เมืองระยอง", "21000", 50},
		{"แกลง", "21110", 50},
		{"จอมบึง", "70150", 51},
		{"ดำเนินสะดวก", "70130", 51},
		{"ท้องถิ่นเทศบาลตำบลบ้านฆ้อง", "70190", 51},
		{"บางแพ", "70160", 51},
		{"บ้านคา", "70180", 51},
		{"บ้านโป่ง", "70110", 51},
		{"ปากท่อ", "70140", 51},
		{"วัดเพลง", "70170", 51},
		{"สวนผึ้ง", "70180", 51},
		{"เมืองราชบุรี", "70000", 51},
		{"โพธาราม", "70120", 51},
		{"ชัยบาดาล", "15130", 52},
		{"ท่าวุ้ง", "15150", 52},
		{"ท่าหลวง", "15230", 52},
		{"บ้านหมี่", "15110", 52},
		{"พัฒนานิคม", "15140", 52},
		{"ลำสนธิ", "15190", 52},
		{"สระโบสถ์", "15240", 52},
		{"หนองม่วง", "15170", 52},
		{"เมืองลพบุรี", "15000", 52},
		{"โคกสำโรง", "15120", 52},
		{"โคกเจริญ", "15250", 52},
		{"งาว", "52110", 53},
		{"วังเหนือ", "52140", 53},
		{"สบปราบ", "52170", 53},
		{"ห้างฉัตร", "52190", 53},
		{"เกาะคา", "52130", 53},
		{"เถิน", "52160", 53},
		{"เมืองปาน", "52240", 53},
		{"เมืองลำปาง", "52000", 53},
		{"เสริมงาม", "52210", 53},
		{"แจ้ห่ม", "52120", 53},
		{"แม่ทะ", "52150", 53},
		{"แม่พริก", "52180", 53},
		{"แม่เมาะ", "52220", 53},
		{"ทุ่งหัวช้าง", "51160", 54},
		{"บ้านธิ", "51180", 54},
		{"บ้านโฮ่ง", "51130", 54},
		{"ป่าซาง", "51120", 54},
		{"ลี้", "51110", 54},
		{"เมืองลำพูน", "51000", 54},
		{"เวียงหนองล่อง", "51120", 54},
		{"แม่ทา", "51140", 54},
		{"ด่านซ้าย", "42120", 55},
		{"ท่าลี่", "42140", 55},
		{"นาด้วง", "42210", 55},
		{"นาแห้ว", "42170", 55},
		{"ปากชม", "42150", 55},
		{"ผาขาว", "42240", 55},
		{"ภูกระดึง", "42180", 55},
		{"ภูหลวง", "42230", 55},
		{"ภูเรือ", "42160", 55},
		{"วังสะพุง", "42130", 55},
		{"หนองหิน", "42190", 55},
		{"เชียงคาน", "42110", 55},
		{"เมืองเลย", "42000", 55},
		{"เอราวัณ", "42220", 55},
		{"กันทรลักษ์", "33110", 56},
		{"กันทรารมย์", "33130", 56},
		{"ขุขันธ์", "33140", 56},
		{"ขุนหาญ", "33150", 56},
		{"น้ำเกลี้ยง", "33130", 56},
		{"บึงบูรพ์", "33220", 56},
		{"ปรางค์กู่", "33170", 56},
		{"พยุห์", "33230", 56},
		{"ภูสิงห์", "33140", 56},
		{"ยางชุมน้อย", "33190", 56},
		{"ราษีไศล", "33160", 56},
		{"วังหิน", "33270", 56},
		{"ศรีรัตนะ", "33240", 56},
		{"ศิลาลาด", "33160", 56},
		{"ห้วยทับทัน", "33210", 56},
		{"อุทุมพรพิสัย", "33120", 56},
		{"เบญจลักษ์", "33110", 56},
		{"เมืองจันทร์", "33120", 56},
		{"เมืองศรีสะเกษ", "33000", 56},
		{"โนนคูณ", "33250", 56},
		{"โพธิ์ศรีสุวรรณ", "33120", 56},
		{"ไพรบึง", "33180", 56},
		{"กุดบาก", "47180", 57},
		{"กุสุมาลย์", "47210", 57},
		{"คำตากล้า", "47250", 57},
		{"นิคมน้ำอูน", "47270", 57},
		{"บ้านม่วง", "47140", 57},
		{"พรรณานิคม", "47130", 57},
		{"พังโคน", "47160", 57},
		{"ภูพาน", "47180", 57},
		{"วานรนิวาส", "47120", 57},
		{"วาริชภูมิ", "47150", 57},
		{"สว่างแดนดิน", "47110", 57},
		{"ส่องดาว", "47190", 57},
		{"อากาศอำนวย", "47170", 57},
		{"เจริญศิลป์", "47290", 57},
		{"เต่างอย", "47260", 57},
		{"เมืองสกลนคร", "47000", 57},
		{"โคกศรีสุพรรณ", "47280", 57},
		{"โพนนาแก้ว", "47230", 57},
		{"กระแสสินธุ์", "90270", 58},
		{"คลองหอยโข่ง", "90230", 58},
		{"ควนเนียง", "90220", 58},
		{"จะนะ", "90130", 58},
		{"ท้องถิ่นเทศบาลตำบลสำนักขาม", "90100", 58},
		{"นาทวี", "90160", 58},
		{"นาหม่อม", "90310", 58},
		{"บางกล่ำ", "90110", 58},
		{"ระโนด", "90140", 58},
		{"รัตภูมิ", "90180", 58},
		{"สทิงพระ", "90190", 58},
		{"สะบ้าย้อย", "90210", 58},
		{"สะเดา", "90120", 58},
		{"สิงหนคร", "90280", 58},
		{"หาดใหญ่", "90110", 58},
		{"เทพา", "90150", 58},
		{"เมืองสงขลา", "90000", 58},
		{"ควนกาหลง", "91130", 59},
		{"ควนโดน", "91160", 59},
		{"ท่าแพ", "91150", 59},
		{"ทุ่งหว้า", "91120", 59},
		{"มะนัง", "91130", 59},
		{"ละงู", "91110", 59},
		{"เมืองสตูล", "91000", 59},
		{"บางบ่อ", "10560", 60},
		{"บางพลี", "10540", 60},
		{"บางเสาธง", "10540", 60},
		{"พระประแดง", "10130", 60},
		{"พระสมุทรเจดีย์", "10290", 60},
		{"เมืองสมุทรปราการ", "10270", 60},
		{"บางคนที", "75120", 61},
		{"อัมพวา", "75110", 61},
		{"เมืองสมุทรสงคราม", "75000", 61},
		{"กระทุ่มแบน", "74110", 62},
		{"บ้านแพ้ว", "74120", 62},
		{"เมืองสมุทรสาคร", "74000", 62},
		{"คลองหาด", "27260", 63},
		{"ตาพระยา", "27180", 63},
		{"วังน้ำเย็น", "27210", 63},
		{"วังสมบูรณ์", "27250", 63},
		{"วัฒนานคร", "27160", 63},
		{"อรัญประเทศ", "27120", 63},
		{"เขาฉกรรจ์", "27000", 63},
		{"เมืองสระแก้ว", "27000", 63},
		{"โคกสูง", "27120", 63},
		{"ดอนพุด", "18210", 64},
		{"บ้านหมอ", "18130", 64},
		{"พระพุทธบาท", "18120", 64},
		{"มวกเหล็ก", "18180", 64},
		{"วังม่วง", "18220", 64},
		{"วิหารแดง", "18150", 64},
		{"หนองแค", "18140", 64},
		{"หนองแซง", "18170", 64},
		{"หนองโดน", "18190", 64},
		{"เฉลิมพระเกียรติ", "18000", 64},
		{"เมืองสระบุรี", "18000", 64},
		{"เสาไห้", "18160", 64},
		{"แก่งคอย", "18110", 64},
		{"ค่ายบางระจัน", "16150", 65},
		{"ท่าช้าง", "16140", 65},
		{"บางระจัน", "16130", 65},
		{"พรหมบุรี", "16120", 65},
		{"อินทร์บุรี", "16110", 65},
		{"เมืองสิงห์บุรี", "16000", 65},
		{"กงไกรลาศ", "64170", 66},
		{"คีรีมาศ", "64160", 66},
		{"ทุ่งเสลี่ยม", "64230", 66},
		{"บ้านด่านลานหอย", "64140", 66},
		{"ศรีนคร", "64180", 66},
		{"ศรีสัชนาลัย", "64130", 66},
		{"ศรีสำโรง", "64120", 66},
		{"สวรรคโลก", "64110", 66},
		{"เมืองสุโขทัย", "64000", 66},
		{"ดอนเจดีย์", "72170", 67},
		{"ด่านช้าง", "72180", 67},
		{"บางปลาม้า", "72150", 67},
		{"ศรีประจันต์", "72140", 67},
		{"สองพี่น้อง", "72110", 67},
		{"สามชุก", "72130", 67},
		{"หนองหญ้าไซ", "72240", 67},
		{"อู่ทอง", "72160", 67},
		{"เดิมบางนางบวช", "72120", 67},
		{"เมืองสุพรรณบุรี", "72000", 67},
		{"กาญจนดิษฐ์", "84290", 84},
		{"คีรีรัฐนิคม", "84180", 84},
		{"ชัยบุรี", "84350", 84},
		{"ดอนสัก", "84220", 84},
		{"ท่าฉาง", "84150", 84},
		{"ท่าชนะ", "84170", 84},
		{"บ้านตาขุน", "84230", 84},
		{"บ้านนาสาร", "84120", 84},
		{"บ้านนาเดิม", "84240", 84},
		{"พนม", "84250", 84},
		{"พระแสง", "84210", 84},
		{"พุนพิน", "84130", 84},
		{"วิภาวดี", "84180", 84},
		{"เกาะพะงัน", "84280", 84},
		{"เกาะสมุย", "84140", 84},
		{"เคียนซา", "84260", 84},
		{"เมืองสุราษฎร์ธานี", "84000", 84},
		{"เวียงสระ", "84190", 84},
		{"ไชยา", "84110", 84},
		{"กาบเชิง", "32210", 69},
		{"จอมพระ", "32180", 69},
		{"ชุมพลบุรี", "32190", 69},
		{"ท่าตูม", "32120", 69},
		{"บัวเชด", "32230", 69},
		{"ปราสาท", "32140", 69},
		{"พนมดงรัก", "32140", 69},
		{"รัตนบุรี", "32130", 69},
		{"ลำดวน", "32220", 69},
		{"ศรีณรงค์", "32150", 69},
		{"ศีขรภูมิ", "32110", 69},
		{"สนม", "32160", 69},
		{"สังขะ", "32150", 69},
		{"สำโรงทาบ", "32170", 69},
		{"เขวาสินรินทร์", "32000", 69},
		{"เมืองสุรินทร์", "32000", 69},
		{"โนนนารายณ์", "32130", 69},
		{"ท่าบ่อ", "43110", 70},
		{"รัตนวาปี", "43120", 70},
		{"ศรีเชียงใหม่", "43130", 70},
		{"สระใคร", "43100", 70},
		{"สังคม", "43160", 70},
		{"เฝ้าไร่", "43120", 70},
		{"เมืองหนองคาย", "43000", 70},
		{"โพธิ์ตาก", "43130", 70},
		{"โพนพิสัย", "43120", 70},
		{"นากลาง", "39170", 71},
		{"นาวัง", "39170", 71},
		{"ศรีบุญเรือง", "39180", 71},
		{"สุวรรณคูหา", "39270", 71},
		{"เมืองหนองบัวลำภู", "39000", 71},
		{"โนนสัง", "39140", 71},
		{"ป่าโมก", "14130", 72},
		{"วิเศษชัยชาญ", "14110", 72},
		{"สามโก้", "14160", 72},
		{"เมืองอ่างทอง", "14000", 72},
		{"แสวงหา", "14150", 72},
		{"โพธิ์ทอง", "14120", 72},
		{"ไชโย", "14140", 72},
		{"กุดจับ", "41250", 73},
		{"กุมภวาปี", "41110", 73},
		{"กู่แก้ว", "41130", 73},
		{"ทุ่งฝน", "41310", 73},
		{"นายูง", "41380", 73},
		{"น้ำโสม", "41210", 73},
		{"บ้านดุง", "41190", 73},
		{"บ้านผือ", "41160", 73},
		{"ประจักษ์ศิลปาคม", "41110", 73},
		{"พิบูลย์รักษ์", "41130", 73},
		{"วังสามหมอ", "41280", 73},
		{"ศรีธาตุ", "41230", 73},
		{"สร้างคอม", "41260", 73},
		{"หนองวัวซอ", "41360", 73},
		{"หนองหาน", "41130", 73},
		{"หนองแสง", "41340", 73},
		{"เพ็ญ", "41150", 73},
		{"เมืองอุดรธานี", "41000", 73},
		{"โนนสะอาด", "41240", 73},
		{"ไชยวาน", "41290", 73},
		{"ตรอน", "53140", 74},
		{"ทองแสนขัน", "53230", 74},
		{"ท่าปลา", "53150", 74},
		{"น้ำปาด", "53110", 74},
		{"บ้านโคก", "53180", 74},
		{"พิชัย", "53120", 74},
		{"ฟากท่า", "53160", 74},
		{"ลับแล", "53130", 74},
		{"เมืองอุตรดิตถ์", "53000", 74},
		{"ทัพทัน", "61120", 75},
		{"บ้านไร่", "61140", 75},
		{"ลานสัก", "61160", 75},
		{"สว่างอารมณ์", "61150", 75},
		{"หนองขาหย่าง", "61130", 75},
		{"หนองฉาง", "61110", 75},
		{"ห้วยคต", "61170", 75},
		{"เมืองอุทัยธานี", "61000", 75},
		{"กุดข้าวปุ้น", "34270", 76},
		{"ดอนมดแดง", "34000", 76},
		{"ตระการพืชผล", "34130", 76},
		{"ตาลสุม", "34330", 76},
		{"ทุ่งศรีอุดม", "34160", 76},
		{"นาจะหลวย", "34280", 76},
		{"นาตาล", "34170", 76},
		{"นาเยีย", "34160", 76},
		{"น้ำขุ่น", "34260", 76},
		{"น้ำยืน", "34260", 76},
		{"บุณฑริก", "34230", 76},
		{"พิบูลมังสาหาร", "34110", 76},
		{"ม่วงสามสิบ", "34140", 76},
		{"วารินชำราบ", "34190", 76},
		{"ศรีเมืองใหม่", "34250", 76},
		{"สว่างวีระวงศ์", "34190", 76},
		{"สำโรง", "34360", 76},
		{"สิรินธร", "34350", 76},
		{"เขมราฐ", "34170", 76},
		{"เขื่องใน", "34150", 76},
		{"เดชอุดม", "34160", 76},
		{"เมืองอุบลราชธานี", "34000", 76},
		{"เหล่าเสือโก้ก", "34000", 76},
		{"โขงเจียม", "34220", 76},
		{"โพธิ์ไทร", "34340", 76},
		{"ชานุมาน", "37210", 77},
		{"ปทุมราชวงศา", "37110", 77},
		{"พนา", "37180", 77},
		{"ลืออำนาจ", "37000", 77},
		{"หัวตะพาน", "37240", 77},
		{"เมืองอำนาจเจริญ", "37000", 77},
		{"เสนางคนิคม", "37290", 77},
	}
	for _, data := range districtsData {
		createDistrict(db, data.Name, data.PostCode, data.ProvinceID)
	}

	// -------------------------------------------<< Occupation >>------------------------------------

	// Create Occupations
	occupations := []string{
		"กรรมกร", "กัปตันเครื่องบิน", "ยามรักษาความปลอดภัย", "ข้าราชการ", "คนขับรถ", "คนขับรถม้า", "คนขายหนังสือ", "คนทำขนมปัง", "คนรับใช้",
		"คนใช้ผู้หญิง", "ครู, อาจารย์", "จักษุแพทย์", "จักษุแพทย์", "ชาวนา", "ชาวประมง", "ชาวสวน", "ช่างกล", "ช่างกุญแจ", "ช่างก่อสร้าง", "ช่างซ่อมนาฬิกา",
		"ช่างตัดผมชาย", "ช่างตัดผมสตรี", "ช่างตัดเสื้อ", "ช่างถ่ายรูป", "ช่างทอง", "ช่างทอผ้า", "ช่างทาสี", "ช่างประปา", "ช่างแกะสลัก, ปั้น", "ช่างแต่งหน้า",
		"ช่างไฟ", "ช่างไม้", "ตำรวจ", "ทนายความ", "ทหารบก", "ทหารเรือ", "ทำงานอิสระ", "นักกฎหมาย, ทนาย", "นักกายกรรม", "นักการทูต", "นักการเมือง",
		"นักกีฬา", "นักกีฬา", "นักคณิตศาสตร์ประกันภัย", "นักชงกาแฟ", "นักชิมอาหาร", "นักชีววิทยา", "นักดนตรี", "นักดับเพลิง", "นักดาราศาสตร์", "นักตกแต่ง",
		"นักธรณีวิทยา", "นักบวชสอนศาสนา", "นักบัญชี", "นักบิน", "นักบิน", "นักบินอวกาศ", "นักประพันธ์", "นักประวัติศาสตร์", "นักมายากล", "นักร้อง", "นักวิทยาศาสตร์",
		"นักสืบ", "นักหนังสือพิมพ์", "นักออกแบบ", "นักเขียน", "นักเขียนโปรแกรมคอมพิวเตอร์", "นักเคมี", "นักเต้น", "นักเรียน", "นักแสดงชาย", "นักแสดงหญิง",
		"นักโฆษณา", "นักโบราณคดี", "นักโภชนบำบัด", "นักโภชนา", "นางพยาบาล", "นางแบบ", "นายธนาคาร", "นายหน้าซื้อขาย", "บรรณารักษ์", "บริกรชาย",
		"บริกรหญิง", "บาร์เทนเดอร์", "บุรุษไปรษณีย์", "ผู้กำกับฝ่ายศิลป์", "ผู้ตรวจสอบบัญชี", "ผู้นำทาง", "ผู้ประกาศ", "ผู้พิพากษา", "ผู้รายงานข่าว", "ผู้ออกแบบเสื้อผ้า",
		"ผู้เชี่ยวชาญการวัดสายตาประกอบแว่น", "พนักงานขาย", "พนักงานขายในร้าน", "พนักงานดับเพลิง", "พนักงานต้อนรับ", "พนักงานต้อนรับบนเครื่องบิน",
		"พนักงานต้อนรับหญิง บนเครื่องบิน", "พนักงานบาร์ผู้ชาย", "พนักงานประจำร้าน", "พนักงานรับจ่ายเงิน", "พี่เลี้ยงเด็ก", "พ่อค้า", "ภารโรง", "มัคคุเทศก์",
		"ยามรักษาการณ์", "ล่าม, ผู้แปล", "วิศวกรรมการบินและอวกาศ", "ศิลปิน", "สถาปนิก", "สัตวแพทย์", "สารวัตร, นายตำรวจ", "หัวหน้าพ่อครัว", "อายุรแพทย์หัวใจ",
		"เจ้าของร้าน", "เจ้าหน้าที่", "เจ้าหน้าที่ชำนาญการโฆษณา", "เจ้าหน้าที่อำนวยความสะดวก", "เภสัชกร", "เลขานุการ", "เสมียน", "แพทย์",
		"แพทย์ฝังเข็ม", "อาชีพอื่นๆ",
	}

	for _, occupation := range occupations {
		createOccupation(db, occupation)
	}

	// -------------------------------------------<< Salary >>------------------------------------

	// Create Salaries
	salaries := []string{
		"น้อยกว่า 5,000", "5,001 - 10,000", "10,001 - 20,000", "20,001 - 50,000", "มากกว่า 50,000",
	}

	for _, salary := range salaries {
		createSalary(db, salary)
	}

	// -------------------------------------------<< User >>------------------------------------

	// Create Users

	// Step 1: Convert the integer to a uint.
	// ID1 := uint(1)

	// // Step 2: Get the pointer to the uint value.
	// IDPtr1 := &ID1

	ID1 := uint(1)
	IDPtr1 := &ID1
	ID2 := uint(2)
	IDPtr2 := &ID2
	ID3 := uint(3)
	IDPtr3 := &ID3
	ID4 := uint(4)
	IDPtr4 := &ID4
	ID5 := uint(5)
	IDPtr5 := &ID5
	// ID6 := uint(6)
	// IDPtr6 := &ID6
	ID7 := uint(7)
	IDPtr7 := &ID7
	// ID8 := uint(8)
	// IDPtr8 := &ID8
	ID9 := uint(9)
	IDPtr9 := &ID9
	// ID10 := uint(10)
	// IDPtr10 := &ID10

	password1, _ := bcrypt.GenerateFromPassword([]byte("111"), 14)
	user1 := User{
		Firstname:    "ชูเกียรติ",
		Lastname:     "ก๋าอินตา",
		Email:        "ppoqqgu00@gmail.com",
		Password:     string(password1),
		Role:         "User",
		GenderID:     IDPtr1,
		DistrictID:   IDPtr1,
		OccupationID: IDPtr1,
		SalaryID:     IDPtr1,
	}
	db.Model(&User{}).Create(&user1)

	user2 := User{
		Firstname:    "Fname1",
		Lastname:     "Lname1",
		Email:        "User1@gmail.com",
		Password:     string(password1),
		Role:         "User",
		GenderID:     IDPtr1,
		DistrictID:   IDPtr2,
		OccupationID: IDPtr3,
		SalaryID:     IDPtr4,
	}
	db.Model(&User{}).Create(&user2)

	user3 := User{
		Firstname:    "Fname2",
		Lastname:     "Lname2",
		Email:        "User2@gmail.com",
		Password:     string(password1),
		Role:         "User",
		GenderID:     IDPtr2,
		DistrictID:   IDPtr3,
		OccupationID: IDPtr4,
		SalaryID:     IDPtr5,
	}
	db.Model(&User{}).Create(&user3)

	admin1 := User{
		Firstname:    "FAdmin1",
		Lastname:     "LAdmin1",
		Email:        "Admin1@gmail.com",
		Password:     string(password1),
		Role:         "Admin",
		GenderID:     IDPtr1,
		DistrictID:   IDPtr2,
		OccupationID: IDPtr1,
		SalaryID:     IDPtr5,
	}
	db.Model(&User{}).Create(&admin1)

	admin2 := User{
		Firstname:    "FAdmin2",
		Lastname:     "LAdmin2",
		Email:        "Admin2@gmail.com",
		Password:     string(password1),
		Role:         "Admin",
		GenderID:     IDPtr1,
		DistrictID:   IDPtr1,
		OccupationID: IDPtr1,
		SalaryID:     IDPtr1,
	}
	db.Model(&User{}).Create(&admin2)

	// -------------------------------------------<< ProductType >>------------------------------------

	type1 := ProductType{
		Name: "แชมพู",
	}
	db.Model(&ProductType{}).Create(&type1)

	type2 := ProductType{
		Name: "สบู่",
	}
	db.Model(&ProductType{}).Create(&type2)

	type3 := ProductType{
		Name: "สครับ",
	}
	db.Model(&ProductType{}).Create(&type3)

	type4 := ProductType{
		Name: "โฟมล้างหน้า",
	}
	db.Model(&ProductType{}).Create(&type4)

	type5 := ProductType{
		Name: "ครีมนวดผม",
	}
	db.Model(&ProductType{}).Create(&type5)

	type6 := ProductType{
		Name: "ไม้แปรงฟัน",
	}
	db.Model(&ProductType{}).Create(&type6)

	type7 := ProductType{
		Name: "ยาสีฟัน",
	}
	db.Model(&ProductType{}).Create(&type7)

	type8 := ProductType{
		Name: "ครีมบำรุงผิว",
	}
	db.Model(&ProductType{}).Create(&type8)

	type9 := ProductType{
		Name: "ครีมกันแดด",
	}
	db.Model(&ProductType{}).Create(&type9)

	type10 := ProductType{
		Name: "ครีมแต้มสิว",
	}
	db.Model(&ProductType{}).Create(&type10)

	// -------------------------------------------<< Promotion >>------------------------------------

	promotion1 := Promotion{
		Name:       "ไม่มีโปรโมชั่น",
		Percentage: 0,
	}
	db.Model(&Promotion{}).Create(&promotion1)

	promotion2 := Promotion{
		Name:       "ซื้อ 2 ชิ้น ลด 10%",
		Percentage: 10,
	}
	db.Model(&Promotion{}).Create(&promotion2)

	promotion3 := Promotion{
		Name:       "ซื้อ 1 แถม 1",
		Percentage: 0,
	}
	db.Model(&Promotion{}).Create(&promotion3)

	promotion4 := Promotion{
		Name:       "คูปองส่วนลดห้าง The mall korat 500 บาท",
		Percentage: 0,
	}
	db.Model(&Promotion{}).Create(&promotion4)

	// -------------------------------------------<< Product >>------------------------------------

	product1 := Product{
		Name:          "สครับขจัดผิวคล้ำ กระจ่างใสขึ้น",
		ProductPhoto:  "https://inwfile.com/s-fx/bat37m.jpg",
		Description:   "สครับจากขมิ้นธรรมชาติ 100% ทาสครับบนผิวแล้วใช้มือลูบเบาๆเป็นวงกลม แนะนำให้ใช้สม่ำเสมอทุกๆ 3 วัน",
		ProductTypeID: IDPtr3,
		PromotionID:   IDPtr2,
		UserID:        IDPtr2,
	}
	db.Model(&Product{}).Create(&product1)

	product2 := Product{
		Name:          "ยาสีฟันสมุนไพรเน้นๆ หอมชื่นใจข้ามวันข้ามคืน ฟันขาวขึ้น",
		ProductPhoto:  "https://th-live-01.slatic.net/p/80332193a76bf3ec7cefc386b7f00be5.png",
		Description:   "ยาสีฟันทำมาจากสมุนไพร 9 ชนิด กลิ่นมิ้นต์ แปรงทุกครั้งหลังรับประทานหารจะช่วยฟันขาวไวขึ้น",
		ProductTypeID: IDPtr7,
		PromotionID:   IDPtr1,
		UserID:        IDPtr1,
	}
	db.Model(&Product{}).Create(&product2)

	product3 := Product{
		Name:          "ครีมกันแดด 50+ SPF ป้องกัน UVA และ UVB",
		ProductPhoto:  "https://mpics.mgronline.com/pics/Images/566000002783602.JPEG",
		Description:   "ครีมกันแดดสำหรับออกแดดจัด กิจกรรมกลางแจ้ง ป้องกันรังสี UVA และ UVB เนื้อบางเบาพิเศษ ซึมไว ไม่มัน สบายผิว ใช้ได้ทุกวัน",
		ProductTypeID: IDPtr9,
		PromotionID:   IDPtr4,
		UserID:        IDPtr1,
	}
	db.Model(&Product{}).Create(&product3)

	// -------------------------------------------<< PaymentMethod >>------------------------------------

	PaymentMethod1 := PaymentMethod{
		Name:   "โอนผ่านธนาคาร",
		Method: "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAfQAAAH0CAMAAAD8CC+4AAAABGdBTUEAALGPC/xhBQAAAAFzUkdCAK7OHOkAAABRUExURf///5Db/7b4/rZmCmYAAAAKOtv8/wAAAP//tjqQ2zoAAP/52/W2agA6iAAAZtuQPFY6GWa2///bkJA6AApmtfDbulRkeHKw22SPtpBoULSWahT8vkYAAAZqSURBVHja7d3rcto4AAZQCAWHW4EEyKbv/6Dri2RLtmHDDJ5tm3N+lUhGrD5kS2JnNJsBAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAADAn25RBCd9IXT+codi//JA9dfP6/yxBt6u/6x08++W+eqxu0NZf1H8fImXF+fVe5HYr+INZHmtK23fi7N+/p28/ijWDw3bzXI+60KvM9/eCL1+UVbaFcu5nv6NNCE+ONDb0OvM23eKU4NYujsW9TfKUO+reibcDeexT+u/19Or7a+q+PjR/G3bVL5+1HXyssvnpnyLGEFTc3kNhb3SMEiraHZts/XbhTtyNzZ7o7RMdt3FmmY+Enp1G6n/cw7t04CQ7Z3Qy45s1CPltf1+VFOvvGwXXi1PIYD0/torHQ29rTJPY+uHfkjLs8zHQo//6ooI3TIf3D270I/VxPdybEb9e9PJ20OdZVZWdmv1RShfVaFUNavC7aL5SuSlo6EvN1WN6oL09j0IPXy+ujzP/EbodfVyxLu/50Pn43bo3WzrXPfquZ0y98piPzfzsl0RZ2eLIp13ZbO2PPTYbvPWXQN56PHpXL3hociTHAk9PAyqy/ZWbdnsuXyQzld3Q2/6+tD2f+zMrqy9bntZpTWbd8lLx0d69tblp1o2E4c89PitKWP9zMf56ERuE9tdeKhntp/No7TZwLgfeuy5dMTGsjSCro+bJLLS3fX6Mgy999aXY9ioy0OP37awKMtuUmnocZYSd2XM5IaTuWpq3fTgl0M/52X1Urnt4yz0da80BtefvWehbxe3Qj/FWM+/Ntn+7Ujo5UJjlc7/yMd7eSscW7J9NfRy/bbpxl4/9NHSe6GXbxq+IzdH+rmumwzg4e29avXni5E+nL0fz21vn/4z9GopXXbfSOjtuj2ffHdP/640/O1e6Lcmcskz/WWWThhvzN5jBaH3lmwPhF67GXq4K6/HQ+9KQyP3Qk8/Ri/0cxrrIikdCz3uzizM3u+G3i1xR0IP07GRZ3qYlse5fO+ZnpW2s7uvhJ6P0bj2ig28bbo074RuH7a/Tt+v8nn2Kb584Jne9mq+ag+h90pDdPdv72EEx6Gar/OyH1xOd0IPWwuP/qrztwubZdVE7mezt1rNoMop0HLzyESufBhUC7HLe5HfL5qRnpfWrz9CpfHQq49RrdOrK9a9XeNTGmvZer46zCZyu/DN9TNbf722Sbbeu734/dtDoccHfpH+HjJLJm1JaVjCNRtqN5Zs7afq3ZdDy9lU7XxnyRbnfR7pvdVa82NZXGNfmp/OVg+GHn5Hu76MLtmy0rgjdF7dDj18qu6K/P6e7LC1c7mxzZnrcPeXP3Lb+OEALdj++MfRwwn6YfX/fI68F4X7rND5FltBQhc6f7/LxTT6+7FHAgAAAAAAAAAAAAAAAAAAAAAAAAAAwHe1XcRTEvPTdba77ECf51brFbYXTdooQXNmdd1j7bFY9avXY3p013Or5YXJRZM2SlAdmLZshkk4li+cmFeda/yxiof0PbdaXphcNGmjtKEv/1mFU6/i2WjNoZjt+br1P55bLS9MLpq0UdoH+iweddYdeHZoxs++PUx3/eRqeWF30aSNkgk99nkNT7765LPD9WOW99jzqvUKk9AnbJSR0Dv5yaTpAcdPrJYX9i+atFGGPbYrRs65f3q1vDC/aNpGGfZYcg59fcLy/mOSanlhctHUjTLssfJFu75pjtXez6eolhf2Q5+uUYY9Vv47f/5VOx+nCarlhb3b83SNMuzxQYfFNe/Tq+WF/YnYVI0y7PHXY+ywbbv6aee+T652TLNpLpq8UYahJ0EkQ2fQsc+olmc+2FyZplGGoWdBLJIlcLaB8pRqvcxn7TbqlI0y7PH8YVgue6pfK2bVj5PrZ1cbPHfDRZM2ysg27I+iVfXcW/yVMt8AeUa1fmE3UidslC+EPtv+qn6OXrb/B8Lzqt0OfcJGAQAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAvrt/AYDxk/uj2CgbAAAAAElFTkSuQmCC",
	}
	db.Model(&PaymentMethod{}).Create(&PaymentMethod1)

	PaymentMethod2 := PaymentMethod{
		Name:   "ติดต่อทางไลน์",
		Method: "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAfQAAAH0BAMAAAA5+MK5AAAABGdBTUEAALGPC/xhBQAAAAFzUkdCAK7OHOkAAAAtUExURf///wAAAGi2/QIKUv7blzoEAH0sBKrw+///0AVKmtv8/tmQPLRmDUCMz/22ZzYHK+cAAAJTSURBVHja7da/attAAMDhGzwYUgxnTR4MnjsGgujQUZm6iD6BH6DgqY/goYSSoVDw5Lmbhz5Ahu5eumTz0Pfo6V+SxjGho+TvIwR8soefTne6EAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACAl93l1f/Rx9WJ6zfltJg+Gyvy8XIzlPSLuD91PR6n7+YDSj8561XjsGf9pFG5OE5v7oj0vqdP4mI9myyz+1T1M75bpbZ9Mx7jppiOytu0wvMwWmbf19NwmFbp42U9cP/Cneld+i7GbBWKVHuZ9r38SXqdXe7Dn/SNz136On25+skQ0j9tr+O+mssP2aqd9e6BX8+26W9UXobrqza9nvR2oO/p6f2Wii7SXIa722drPU15mvg3WbUS2vTr9KEb6Ht61bzL17P08ZA/3+Z2eXoM6mu7Jv1btdF1A71/4Ld1eqwcpa9julzMq5d6k36VLcLDwKDTJ3HaRrbpMc4eBwaSPn/xvX406/OLuBjarFfL98v2aK2/L/9d6/UOP6y13uzwm9d3+FDMBrPDN+nj5WW4iYvX3+vp1LPo+Xu92tXmj+n1aW7enea69PY0d0iHt99PD7K75ng3kPR0hs8ezvBt+tMzfNGlh8OsPsOv+5r+P8Y/Qn0HztAk3oev5eYc0+vVka3OMn30K2ZvAwAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAPTVXxVGvq2xwsywAAAAAElFTkSuQmCC",
	}
	db.Model(&PaymentMethod{}).Create(&PaymentMethod2)

	PaymentMethod3 := PaymentMethod{
		Name:   "สแกนจ่าย",
		Method: "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAlIAAAJSAQMAAAAyEbkwAAAABlBMVEUAAAD///+l2Z/dAAACdUlEQVR42u3d3Y2jMBQGUK8ogBKmlLSeUrYECojCbhQw1z+QjJR92OH4CQX7KE9X1ucLpPlj45pYLBaLxWKxWKx/YU2pHJfnL4/b+Zd5vq0Xf0e1YGCxWCzWsZVXLmie8/hlOLZ+bWX7/p71ta34zWKxWD/GWivkvSAWNKXxcfFYMD5r9Nems1gsFuultWxwl2Id0FCjWSwWi/VtK60VudBnFovFYr1hFZlC2PsuxPRcMG/Wu/kEi8Vi/S/WzrnVgfWdM7AhEL0LFovFYu1bvXFbewuGbVvcKdZv9X+xWCzW2axcf0OUEJPZfPSVJ4fDsDCHxWKxWNeyHyufeOXd8LjW31R1xxa3WCwWi5WOavRla9UqV4ZNcB1AsFgsFquxQuqaGr2MaHMd38sUWCwW6+RWbCkonolto4Rco9tbLBaLxbrWD2h1R5sg7GcKLBaLxZq7UcKw1t/UhAvtHBaLxWJNnf7Va8wU6j7XNqsdj/q/WCwW6+TWLfQWhHAhbHBDh1ZuRDjIFFgsFuvkVl5wS6mfKaQivW27DVgsFovV7YWtk9mxinGLU7HcZMBisVisvf1qPa/c4LYvHdjPJ1gsFuvE1lS0t4aDrks8A+ueioV/wGKxWKz9d7iE3XD5MpdQmqfus1ssFovFahuzLtUTBa1VoSwWi8WaXn2PdQ7NWyFT6LXAVvvo9nuGLBaLdUprnXcvtrzj9rastk22n0+wWCwW6/BbWTFTqKp2P1NgsVgsVu+b2fUGN23dBm3VZrFYLFY6/p5h3RQ7NxFtoc8sFov1E6zuWdOHrKl/9BVK84vnFVgsFuvU1mcGi8VisVgsFov1cesPygP+RN3fPRkAAAAASUVORK5CYII=",
	}
	db.Model(&PaymentMethod{}).Create(&PaymentMethod3)

	// -------------------------------------------<< Receipt >>------------------------------------

	receipt1 := Receipt{
		ReceiptCode: "1234567891",
	}
	db.Model(&Receipt{}).Create(&receipt1)

	receipt2 := Receipt{
		ReceiptCode: "1234567892",
	}
	db.Model(&Receipt{}).Create(&receipt2)

	receipt3 := Receipt{
		ReceiptCode: "1234567893",
	}
	db.Model(&Receipt{}).Create(&receipt3)

	// -------------------------------------------<< Purchase >>------------------------------------

	purchase1 := Purchase{
		Time:            time.Date(1974, time.May, 19, 1, 2, 3, 4, time.UTC),
		PaymentMethodID: IDPtr1,
		ReceiptID:       IDPtr1,
		UserID:          IDPtr1,
		ProductID:       IDPtr1,
	}
	db.Model(&Purchase{}).Create(&purchase1)

	purchase2 := Purchase{
		Time:            time.Date(2000, time.May, 9, 2, 3, 4, 5, time.UTC),
		PaymentMethodID: IDPtr1,
		ReceiptID:       IDPtr1,
		UserID:          IDPtr1,
		ProductID:       IDPtr2,
	}
	db.Model(&Purchase{}).Create(&purchase2)

	purchase3 := Purchase{
		Time:            time.Date(2566, time.May, 1, 1, 1, 1, 1, time.UTC),
		PaymentMethodID: IDPtr3,
		ReceiptID:       IDPtr2,
		UserID:          IDPtr1,
		ProductID:       IDPtr3,
	}
	db.Model(&Purchase{}).Create(&purchase3)

	purchase4 := Purchase{
		Time:            time.Date(2566, time.May, 2, 2, 2, 2, 2, time.UTC),
		PaymentMethodID: IDPtr2,
		ReceiptID:       IDPtr3,
		UserID:          IDPtr2,
		ProductID:       IDPtr3,
	}
	db.Model(&Purchase{}).Create(&purchase4)
}
